In [6]:
import numpy as np
import pandas as pd

In [7]:
from numpy.random import randn

In [8]:
np.random.seed(101)

In [9]:
# df are fancy index marker on top of numpy array
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df[['W','Z']]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

In [9]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df['new'] = df['W']+df['Z']

In [12]:
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  0.616367
B  0.681209  1.035125 -0.031160  1.939932  2.621142
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032
D -1.382920  1.482495  0.961458 -2.141212 -3.524132
E  0.992573  1.192241 -1.046780  1.292765  2.285338

In [15]:
# by def axis mera zero set huta ha and for accessing col I've to define axis as 
# 1 so uske lye ma axis ko param ma pass krnga
# inplace=true means orig info ma modify kru
df.drop('new',axis=1,inplace = True)

In [16]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [17]:
df.drop('E')
# row ko drop kreyga as axis is zero

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [18]:
df.shape
# x axis pe zero y axis pe 1

(5, 4)

In [20]:
df.loc['C']
# getting row's data

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: C, dtype: float64

In [21]:
df.iloc[2]

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: C, dtype: float64

In [22]:
# selecign subset of rows and cols
df.loc['B','Y']

-0.031160481493099617

In [10]:
df.loc[['A','B'],['Y','Z']]
# subset of col and rows

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [11]:
# conditional formatting on dataframes - pandas 
df >0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [12]:
boold = df >0
df[boold]
# this will show us the value in the frames which is greater than zero and will throw Nan where it is less than zero

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
# if you just want to see the rows where the cond is satisfied means you dont wanat to see Nan then :
df[df['W']>0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [32]:
bools = df['W']>0
result = df[bools]
result
mycols = ['Y','Z']
result[mycols]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [36]:

# ab hame 2 cond lani hn tu uske lye hame s\and use ni krenge kio ke wu T or F wali cond ke lye huta
# so we'll use & and for or use | 
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [41]:
# making my own index
new_index = "F G H J I".split()
df['States'] = new_index
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826      F
B  0.651118 -0.319318 -0.848077  0.605965      G
C -2.018168  0.740122  0.528813 -0.589001      H
D  0.188695 -0.758872 -0.933237  0.955057      J
E  0.190794  1.978757  2.605967  0.683509      I

In [42]:
df.set_index('States')
#inplace = true for perm changes

               W         X         Y         Z
States
F       2.706850  0.628133  0.907969  0.503826
G       0.651118 -0.319318 -0.848077  0.605965
H      -2.018168  0.740122  0.528813 -0.589001
J       0.188695 -0.758872 -0.933237  0.955057
I       0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826      F
B  0.651118 -0.319318 -0.848077  0.605965      G
C -2.018168  0.740122  0.528813 -0.589001      H
D  0.188695 -0.758872 -0.933237  0.955057      J
E  0.190794  1.978757  2.605967  0.683509      I

In [44]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [51]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [55]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [57]:
df.index.names=['Groups','Num']
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [60]:
df.loc['G2'].loc[2].loc['B']

0.19679950499134005

In [65]:
# xs - cross section ma ham multi level index ke andar b jaa sktey hn
df.xs(1,level='Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [66]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [68]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [69]:
df.dropna(axis=1)
# na drop the null values

   C
0  1
1  2
2  3

In [70]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [79]:
# thresh is an int val in which non na val are not dropped
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [80]:
df.fillna(value="Fill Value")

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [83]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [84]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [85]:
df = pd.DataFrame(data)

In [86]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [88]:
bycomp = df.groupby('Company')

In [89]:
bycomp.mean()
# person ka ilye mean ni aya kio ke wu non numeric value ha or groupby jab krke operation kruge 
# tu wu ye jeez khd dekhta ha ke kispe operation krna ha ke ni

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [91]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [94]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [95]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [100]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [ ]:
# merging joining and concatenation
# pd.concat(d1,d2,d3) d ka size same hu indexing col rows ki terms ma
# agar concat ma axis use krlu like axis=1 means y axis pe
# tu isme missing values hn kio ke index sabke alag the
# tu concat ma ye jeez ka khayal rkhu ke info kis axis pe nan ni degi
# we'll b joining in terms of col tu hame phele daata ko b dekhna huga
#2 df han left right we use merge function like we did in sql table
# key col pe values match kr rhe ham kio ke wuhi similar hn dunu table ma jiske basis pe merge krenge
# joining ma 2 aesy df ko add krte jinka index alag huta